<template >
  <Nav/>
  <router-view @display="setIndex"/>
  <Footer/>
</template>

<script>
  import Footer from '@/components/Footer.vue'
  import Nav from '@/components/Nav.vue';

  export default {
    name: 'HomeView',
    components: {
      Footer,Nav
    },
    data() {
      return {
        articles:[
        {
          index:0,
          img:"/articles/1.png",
          title:"فوائد القراءة اليومية",
          date:"2 فبراير",
          time:" 5 دقائق قراءة",
          author:"أحمد السيد",
          summary:"القراءة هي نشاط ممتع ومفيد يعزز التعلم والتنمية الشخصية. إن القراءة اليومية لها تأثير كبير على حياتنا وتعزز الذكاء والتفكير الإبداعي. في هذا المقال، سنستكشف فوائد القراءة اليومية وكيف يمكن أن تؤثر بشكل إيجابي على حياتنا.",
          summaryshort:"القراءة هي نشاط ممتع ومفيد يعزز التعلم والتنمية الشخصية.",
          type:"أدب",
          intro:" القراءة هي نافذتنا إلى العالم، إنها رحلة سحرية تأخذنا في استكشاف أفكار الآخرين وتعلم ثقافات جديدة. في العالم العربي، يتمتع الكتاب والأدب بمكانة خاصة، حيث يتميزون بإبداعهم وقدرتهم على صياغة الكلمات بأناقة وجمال. ومن خلال هذا المقال، سنستكشف سحر القراءة في اكتشاف العالم العربي وأهميتها في بناء المعرفة وتعزيز الثقافة.",
          sections:[
            {head:"القراءة نافذة إلى الثقافة ",body:"القراءة تعد أداة قوية لاكتشاف الثقافة العربية والتعرف على تراثها العريق. من خلال قراءة الأدب العربي الكلاسيكي والمعاصر، نلمس جمال اللغة العربية وقوة التعبير فيها. نتعرف على الروائع الأدبية والشعرية التي ترسخ الهوية العربية وتعبر عن تجارب ومشاعر الناس في المنطقة. إنها فرصة للغوص في تاريخنا وتعزيز الفهم للعادات والتقاليد والتحولات الاجتماعية التي شكلتنا."},
            {head:"توسيع الأفق وتحدي العقل",body:" عندما نمارس القراءة، نمارس أيضًا تمرينًا عقليًا يوسع أفقنا ويحفز تفكيرنا. إن قراءة الكتب والمقالات تعزز مهارات التركيز والتفكير النقدي. نتعلم التحليل والتفكير العميق، ونتقن قراءة النصوص بانتباه وتركيز على التفاصيل. كما تعزز القراءة القدرات اللغوية وتثري مفرداتنا وتوسع قدرتنا على التعبير بشكل أفضل."},
            {head:"وسيلة للتأمل والاسترخاء",body:"في عالم مليء بالضغوط والتوترات، تُعد القراءة بوابة للهروب والاسترخاء. عندما نغوص في صفحات الكتب، نجد أنفسنا في عوالم مختلفة تعيد ترتيب أفكارنا وتهدئ أعصابنا. إن الانغماس في قصة مشوقة أو قراءة كتاب يتناول المواضيع التي نهتم بها يمنحنا لحظات هادئة للتأمل والتشبث باللحظة الحالية."},
            {head:"القراءة وتواصل الأجيال",body:"تُعتبر القراءة أيضًا وسيلة لتواصل الأجيال ونقل المعرفة والقيم من جيل إلى جيل. عندما نشارك الكتب والقصص مع أطفالنا وأحفادنا، نبني جسورًا من التواصل والفهم المتبادل. تصبح القراءة لحظات قيّمة تجمع الأسرة وتحفز النقاش والتفاعل البناء بين الأجيال المختلفة."},
            {head:"القراءة وتنمية الذات",body:"إن القراءة تُعَدُّ مصدرًا للتعلم المستمر وتنمية الذات. من خلال قراءة الكتب التعليمية والتطوير الشخصي، نكتسب المهارات والمعرفة الجديدة التي تساعدنا على النمو والتطور. كما تُعَدُّ القراءة للتأمل الذاتي والبحث عن الإلهام والتوجه نحو التحسين المستمر."},
            {head:"القراءة والابتكار والإبداع",body:"عندما نستكشف الكتب والمواد الإبداعية، يتم تحفيز قدراتنا على الابتكار والإبداع. قد تُلهمنا قصة أو فكرة لتجربة أفكار جديدة وتنمية مشاريع مبتكرة. إن القراءة تفتح أمامنا أفقًا للتفكير المستقبلي وتعزز قدرتنا على الابتكار القضايا والمشاكل من زوايا جديدة ومبتكرة."},
            {head:"تعزيز التفاعل الاجتماعي",body:"تُعتبر القراءة أيضًا فرصة لتعزيز التفاعل الاجتماعي والانخراط في مناقشات وحوارات مع الآخرين. عندما نقرأ كتابًا مشتركًا أو ننضم إلى نادي قراءة، يتاح لنا فرصة لتبادل الأفكار والانطباعات وتوسيع آفاقنا. يمكننا أن نتعلم من خلال آراء الآخرين ونتبادل الأفكار والتجارب، مما يغني تجربتنا القرائية ويعزز التواصل الاجتماعي."},
            {head:"القراءة وتحقيق الأهداف",body:"تمتلك القراءة القدرة على توجيهنا نحو تحقيق أهدافنا. عندما نقرأ عن قصص النجاح والإلهام، نجد التحفيز والدفع للتحرك نحو تحقيق أحلامنا. كتب التطوير الذاتي والملهمة تعطينا أدوات واستراتيجيات لتحقيق النجاح والتطور الشخصي."},
            {head:"الختام: ",body:"تبقى القراءة رحلة سحرية ومثيرة في اكتشاف العالم العربي والثقافات الأخرى. إنها أداة قوية لتوسيع آفاقنا وتنمية ذواتنا. تُعَدُّ القراءة مصدرًا للمعرفة والترفيه والإلهام. لذا، لنستمتع بسحر القراءة ونستفيد من فوائدها العديدة في حياتنا اليومية. ليكن الكتاب رفيقًا لنا في رحلتنا، وليساعدنا في بناء عالمنا الداخلي وتحقيق طموحاتن"},
          ],
          liked:false,
          disliked:false,
          comments:[
            {img:"/comments/1.png",name:"احمد محمد",comment:"مقال رائع!"},
            {img:"/comments/2.png",name:"نيهال احمد",comment:'"القراءة تنقلنا إلى عوالم بديلة وتزرع فينا بذور الخيال والتفكير النقدي. أنا ممتنة لهذا الموقع الذي يلهمني دائمًا للغوص في صفحات الكتب واكتشاف عوالم جديدة. شكرًا لكم على هذا الإثراء الثقافي الرائع!"'}
          ]
        },
        {
          index: 1,
          img:"/articles/2.png",
          title:"اليوم العالمي للغة العربية",
          date:"2 فبراير",
          time:" 5 دقائق قراءة",
          author:"أحمد السيد",
          summary:"القراءة هي نشاط ممتع ومفيد يعزز التعلم والتنمية الشخصية. إن القراءة اليومية لها تأثير كبير على حياتنا وتعزز الذكاء والتفكير الإبداعي. في هذا المقال، سنستكشف فوائد القراءة اليومية وكيف يمكن أن تؤثر بشكل إيجابي على حياتنا.",
          summaryshort:"القراءة هي نشاط ممتع ومفيد يعزز التعلم والتنمية الشخصية.",
          type:"أدب",
          intro:" القراءة هي نافذتنا إلى العالم، إنها رحلة سحرية تأخذنا في استكشاف أفكار الآخرين وتعلم ثقافات جديدة. في العالم العربي، يتمتع الكتاب والأدب بمكانة خاصة، حيث يتميزون بإبداعهم وقدرتهم على صياغة الكلمات بأناقة وجمال. ومن خلال هذا المقال، سنستكشف سحر القراءة في اكتشاف العالم العربي وأهميتها في بناء المعرفة وتعزيز الثقافة.",
          sections:[
            {head:"القراءة نافذة إلى الثقافة ",body:"القراءة تعد أداة قوية لاكتشاف الثقافة العربية والتعرف على تراثها العريق. من خلال قراءة الأدب العربي الكلاسيكي والمعاصر، نلمس جمال اللغة العربية وقوة التعبير فيها. نتعرف على الروائع الأدبية والشعرية التي ترسخ الهوية العربية وتعبر عن تجارب ومشاعر الناس في المنطقة. إنها فرصة للغوص في تاريخنا وتعزيز الفهم للعادات والتقاليد والتحولات الاجتماعية التي شكلتنا."},
            {head:"توسيع الأفق وتحدي العقل",body:" عندما نمارس القراءة، نمارس أيضًا تمرينًا عقليًا يوسع أفقنا ويحفز تفكيرنا. إن قراءة الكتب والمقالات تعزز مهارات التركيز والتفكير النقدي. نتعلم التحليل والتفكير العميق، ونتقن قراءة النصوص بانتباه وتركيز على التفاصيل. كما تعزز القراءة القدرات اللغوية وتثري مفرداتنا وتوسع قدرتنا على التعبير بشكل أفضل."},
            {head:"وسيلة للتأمل والاسترخاء",body:"في عالم مليء بالضغوط والتوترات، تُعد القراءة بوابة للهروب والاسترخاء. عندما نغوص في صفحات الكتب، نجد أنفسنا في عوالم مختلفة تعيد ترتيب أفكارنا وتهدئ أعصابنا. إن الانغماس في قصة مشوقة أو قراءة كتاب يتناول المواضيع التي نهتم بها يمنحنا لحظات هادئة للتأمل والتشبث باللحظة الحالية."},
            {head:"القراءة وتواصل الأجيال",body:"تُعتبر القراءة أيضًا وسيلة لتواصل الأجيال ونقل المعرفة والقيم من جيل إلى جيل. عندما نشارك الكتب والقصص مع أطفالنا وأحفادنا، نبني جسورًا من التواصل والفهم المتبادل. تصبح القراءة لحظات قيّمة تجمع الأسرة وتحفز النقاش والتفاعل البناء بين الأجيال المختلفة."},
            {head:"القراءة وتنمية الذات",body:"إن القراءة تُعَدُّ مصدرًا للتعلم المستمر وتنمية الذات. من خلال قراءة الكتب التعليمية والتطوير الشخصي، نكتسب المهارات والمعرفة الجديدة التي تساعدنا على النمو والتطور. كما تُعَدُّ القراءة للتأمل الذاتي والبحث عن الإلهام والتوجه نحو التحسين المستمر."},
            {head:"القراءة والابتكار والإبداع",body:"عندما نستكشف الكتب والمواد الإبداعية، يتم تحفيز قدراتنا على الابتكار والإبداع. قد تُلهمنا قصة أو فكرة لتجربة أفكار جديدة وتنمية مشاريع مبتكرة. إن القراءة تفتح أمامنا أفقًا للتفكير المستقبلي وتعزز قدرتنا على الابتكار القضايا والمشاكل من زوايا جديدة ومبتكرة."},
            {head:"تعزيز التفاعل الاجتماعي",body:"تُعتبر القراءة أيضًا فرصة لتعزيز التفاعل الاجتماعي والانخراط في مناقشات وحوارات مع الآخرين. عندما نقرأ كتابًا مشتركًا أو ننضم إلى نادي قراءة، يتاح لنا فرصة لتبادل الأفكار والانطباعات وتوسيع آفاقنا. يمكننا أن نتعلم من خلال آراء الآخرين ونتبادل الأفكار والتجارب، مما يغني تجربتنا القرائية ويعزز التواصل الاجتماعي."},
            {head:"القراءة وتحقيق الأهداف",body:"تمتلك القراءة القدرة على توجيهنا نحو تحقيق أهدافنا. عندما نقرأ عن قصص النجاح والإلهام، نجد التحفيز والدفع للتحرك نحو تحقيق أحلامنا. كتب التطوير الذاتي والملهمة تعطينا أدوات واستراتيجيات لتحقيق النجاح والتطور الشخصي."},
            {head:"الختام: ",body:"تبقى القراءة رحلة سحرية ومثيرة في اكتشاف العالم العربي والثقافات الأخرى. إنها أداة قوية لتوسيع آفاقنا وتنمية ذواتنا. تُعَدُّ القراءة مصدرًا للمعرفة والترفيه والإلهام. لذا، لنستمتع بسحر القراءة ونستفيد من فوائدها العديدة في حياتنا اليومية. ليكن الكتاب رفيقًا لنا في رحلتنا، وليساعدنا في بناء عالمنا الداخلي وتحقيق طموحاتن"},
          ],
          liked:false,
          disliked:false,
          comments:[
            {img:"/comments/1.png",name:"احمد محمد",comment:"مقال رائع!"},
            {img:"/comments/2.png",name:"نيهال احمد",comment:'"القراءة تنقلنا إلى عوالم بديلة وتزرع فينا بذور الخيال والتفكير النقدي. أنا ممتنة لهذا الموقع الذي يلهمني دائمًا للغوص في صفحات الكتب واكتشاف عوالم جديدة. شكرًا لكم على هذا الإثراء الثقافي الرائع!"'}
          ]
        },
        {
          index:2,
          img:"/articles/3.png",
          title:"فوائد القراءة اليومية",
          date:"2 فبراير",
          time:" 5 دقائق قراءة",
          author:"أحمد السيد",
          summary:"القراءة هي نشاط ممتع ومفيد يعزز التعلم والتنمية الشخصية. إن القراءة اليومية لها تأثير كبير على حياتنا وتعزز الذكاء والتفكير الإبداعي. في هذا المقال، سنستكشف فوائد القراءة اليومية وكيف يمكن أن تؤثر بشكل إيجابي على حياتنا.",
          summaryshort:"القراءة هي نشاط ممتع ومفيد يعزز التعلم والتنمية الشخصية.",
          type:"أدب",
          intro:" القراءة هي نافذتنا إلى العالم، إنها رحلة سحرية تأخذنا في استكشاف أفكار الآخرين وتعلم ثقافات جديدة. في العالم العربي، يتمتع الكتاب والأدب بمكانة خاصة، حيث يتميزون بإبداعهم وقدرتهم على صياغة الكلمات بأناقة وجمال. ومن خلال هذا المقال، سنستكشف سحر القراءة في اكتشاف العالم العربي وأهميتها في بناء المعرفة وتعزيز الثقافة.",
          sections:[
            {head:"القراءة نافذة إلى الثقافة ",body:"القراءة تعد أداة قوية لاكتشاف الثقافة العربية والتعرف على تراثها العريق. من خلال قراءة الأدب العربي الكلاسيكي والمعاصر، نلمس جمال اللغة العربية وقوة التعبير فيها. نتعرف على الروائع الأدبية والشعرية التي ترسخ الهوية العربية وتعبر عن تجارب ومشاعر الناس في المنطقة. إنها فرصة للغوص في تاريخنا وتعزيز الفهم للعادات والتقاليد والتحولات الاجتماعية التي شكلتنا."},
            {head:"توسيع الأفق وتحدي العقل",body:" عندما نمارس القراءة، نمارس أيضًا تمرينًا عقليًا يوسع أفقنا ويحفز تفكيرنا. إن قراءة الكتب والمقالات تعزز مهارات التركيز والتفكير النقدي. نتعلم التحليل والتفكير العميق، ونتقن قراءة النصوص بانتباه وتركيز على التفاصيل. كما تعزز القراءة القدرات اللغوية وتثري مفرداتنا وتوسع قدرتنا على التعبير بشكل أفضل."},
            {head:"وسيلة للتأمل والاسترخاء",body:"في عالم مليء بالضغوط والتوترات، تُعد القراءة بوابة للهروب والاسترخاء. عندما نغوص في صفحات الكتب، نجد أنفسنا في عوالم مختلفة تعيد ترتيب أفكارنا وتهدئ أعصابنا. إن الانغماس في قصة مشوقة أو قراءة كتاب يتناول المواضيع التي نهتم بها يمنحنا لحظات هادئة للتأمل والتشبث باللحظة الحالية."},
            {head:"القراءة وتواصل الأجيال",body:"تُعتبر القراءة أيضًا وسيلة لتواصل الأجيال ونقل المعرفة والقيم من جيل إلى جيل. عندما نشارك الكتب والقصص مع أطفالنا وأحفادنا، نبني جسورًا من التواصل والفهم المتبادل. تصبح القراءة لحظات قيّمة تجمع الأسرة وتحفز النقاش والتفاعل البناء بين الأجيال المختلفة."},
            {head:"القراءة وتنمية الذات",body:"إن القراءة تُعَدُّ مصدرًا للتعلم المستمر وتنمية الذات. من خلال قراءة الكتب التعليمية والتطوير الشخصي، نكتسب المهارات والمعرفة الجديدة التي تساعدنا على النمو والتطور. كما تُعَدُّ القراءة للتأمل الذاتي والبحث عن الإلهام والتوجه نحو التحسين المستمر."},
            {head:"القراءة والابتكار والإبداع",body:"عندما نستكشف الكتب والمواد الإبداعية، يتم تحفيز قدراتنا على الابتكار والإبداع. قد تُلهمنا قصة أو فكرة لتجربة أفكار جديدة وتنمية مشاريع مبتكرة. إن القراءة تفتح أمامنا أفقًا للتفكير المستقبلي وتعزز قدرتنا على الابتكار القضايا والمشاكل من زوايا جديدة ومبتكرة."},
            {head:"تعزيز التفاعل الاجتماعي",body:"تُعتبر القراءة أيضًا فرصة لتعزيز التفاعل الاجتماعي والانخراط في مناقشات وحوارات مع الآخرين. عندما نقرأ كتابًا مشتركًا أو ننضم إلى نادي قراءة، يتاح لنا فرصة لتبادل الأفكار والانطباعات وتوسيع آفاقنا. يمكننا أن نتعلم من خلال آراء الآخرين ونتبادل الأفكار والتجارب، مما يغني تجربتنا القرائية ويعزز التواصل الاجتماعي."},
            {head:"القراءة وتحقيق الأهداف",body:"تمتلك القراءة القدرة على توجيهنا نحو تحقيق أهدافنا. عندما نقرأ عن قصص النجاح والإلهام، نجد التحفيز والدفع للتحرك نحو تحقيق أحلامنا. كتب التطوير الذاتي والملهمة تعطينا أدوات واستراتيجيات لتحقيق النجاح والتطور الشخصي."},
            {head:"الختام: ",body:"تبقى القراءة رحلة سحرية ومثيرة في اكتشاف العالم العربي والثقافات الأخرى. إنها أداة قوية لتوسيع آفاقنا وتنمية ذواتنا. تُعَدُّ القراءة مصدرًا للمعرفة والترفيه والإلهام. لذا، لنستمتع بسحر القراءة ونستفيد من فوائدها العديدة في حياتنا اليومية. ليكن الكتاب رفيقًا لنا في رحلتنا، وليساعدنا في بناء عالمنا الداخلي وتحقيق طموحاتن"},
          ],
          liked:false,
          disliked:false,
          comments:[
            {img:"/comments/1.png",name:"احمد محمد",comment:"مقال رائع!"},
            {img:"/comments/2.png",name:"نيهال احمد",comment:'"القراءة تنقلنا إلى عوالم بديلة وتزرع فينا بذور الخيال والتفكير النقدي. أنا ممتنة لهذا الموقع الذي يلهمني دائمًا للغوص في صفحات الكتب واكتشاف عوالم جديدة. شكرًا لكم على هذا الإثراء الثقافي الرائع!"'}
          ]
        },
        {
          index:3,
          img:"/articles/4.png",
          title:"جولة في عالم الأدب العربي",
          date:"2 فبراير",
          time:" 5 دقائق قراءة",
          author:"أحمد السيد",
          summary:"القراءة هي نشاط ممتع ومفيد يعزز التعلم والتنمية الشخصية. إن القراءة اليومية لها تأثير كبير على حياتنا وتعزز الذكاء والتفكير الإبداعي. في هذا المقال، سنستكشف فوائد القراءة اليومية وكيف يمكن أن تؤثر بشكل إيجابي على حياتنا.",
          summaryshort:"القراءة هي نشاط ممتع ومفيد يعزز التعلم والتنمية الشخصية.",
          type:"أدب",
          intro:" القراءة هي نافذتنا إلى العالم، إنها رحلة سحرية تأخذنا في استكشاف أفكار الآخرين وتعلم ثقافات جديدة. في العالم العربي، يتمتع الكتاب والأدب بمكانة خاصة، حيث يتميزون بإبداعهم وقدرتهم على صياغة الكلمات بأناقة وجمال. ومن خلال هذا المقال، سنستكشف سحر القراءة في اكتشاف العالم العربي وأهميتها في بناء المعرفة وتعزيز الثقافة.",
          sections:[
            {head:"القراءة نافذة إلى الثقافة ",body:"القراءة تعد أداة قوية لاكتشاف الثقافة العربية والتعرف على تراثها العريق. من خلال قراءة الأدب العربي الكلاسيكي والمعاصر، نلمس جمال اللغة العربية وقوة التعبير فيها. نتعرف على الروائع الأدبية والشعرية التي ترسخ الهوية العربية وتعبر عن تجارب ومشاعر الناس في المنطقة. إنها فرصة للغوص في تاريخنا وتعزيز الفهم للعادات والتقاليد والتحولات الاجتماعية التي شكلتنا."},
            {head:"توسيع الأفق وتحدي العقل",body:" عندما نمارس القراءة، نمارس أيضًا تمرينًا عقليًا يوسع أفقنا ويحفز تفكيرنا. إن قراءة الكتب والمقالات تعزز مهارات التركيز والتفكير النقدي. نتعلم التحليل والتفكير العميق، ونتقن قراءة النصوص بانتباه وتركيز على التفاصيل. كما تعزز القراءة القدرات اللغوية وتثري مفرداتنا وتوسع قدرتنا على التعبير بشكل أفضل."},
            {head:"وسيلة للتأمل والاسترخاء",body:"في عالم مليء بالضغوط والتوترات، تُعد القراءة بوابة للهروب والاسترخاء. عندما نغوص في صفحات الكتب، نجد أنفسنا في عوالم مختلفة تعيد ترتيب أفكارنا وتهدئ أعصابنا. إن الانغماس في قصة مشوقة أو قراءة كتاب يتناول المواضيع التي نهتم بها يمنحنا لحظات هادئة للتأمل والتشبث باللحظة الحالية."},
            {head:"القراءة وتواصل الأجيال",body:"تُعتبر القراءة أيضًا وسيلة لتواصل الأجيال ونقل المعرفة والقيم من جيل إلى جيل. عندما نشارك الكتب والقصص مع أطفالنا وأحفادنا، نبني جسورًا من التواصل والفهم المتبادل. تصبح القراءة لحظات قيّمة تجمع الأسرة وتحفز النقاش والتفاعل البناء بين الأجيال المختلفة."},
            {head:"القراءة وتنمية الذات",body:"إن القراءة تُعَدُّ مصدرًا للتعلم المستمر وتنمية الذات. من خلال قراءة الكتب التعليمية والتطوير الشخصي، نكتسب المهارات والمعرفة الجديدة التي تساعدنا على النمو والتطور. كما تُعَدُّ القراءة للتأمل الذاتي والبحث عن الإلهام والتوجه نحو التحسين المستمر."},
            {head:"القراءة والابتكار والإبداع",body:"عندما نستكشف الكتب والمواد الإبداعية، يتم تحفيز قدراتنا على الابتكار والإبداع. قد تُلهمنا قصة أو فكرة لتجربة أفكار جديدة وتنمية مشاريع مبتكرة. إن القراءة تفتح أمامنا أفقًا للتفكير المستقبلي وتعزز قدرتنا على الابتكار القضايا والمشاكل من زوايا جديدة ومبتكرة."},
            {head:"تعزيز التفاعل الاجتماعي",body:"تُعتبر القراءة أيضًا فرصة لتعزيز التفاعل الاجتماعي والانخراط في مناقشات وحوارات مع الآخرين. عندما نقرأ كتابًا مشتركًا أو ننضم إلى نادي قراءة، يتاح لنا فرصة لتبادل الأفكار والانطباعات وتوسيع آفاقنا. يمكننا أن نتعلم من خلال آراء الآخرين ونتبادل الأفكار والتجارب، مما يغني تجربتنا القرائية ويعزز التواصل الاجتماعي."},
            {head:"القراءة وتحقيق الأهداف",body:"تمتلك القراءة القدرة على توجيهنا نحو تحقيق أهدافنا. عندما نقرأ عن قصص النجاح والإلهام، نجد التحفيز والدفع للتحرك نحو تحقيق أحلامنا. كتب التطوير الذاتي والملهمة تعطينا أدوات واستراتيجيات لتحقيق النجاح والتطور الشخصي."},
            {head:"الختام: ",body:"تبقى القراءة رحلة سحرية ومثيرة في اكتشاف العالم العربي والثقافات الأخرى. إنها أداة قوية لتوسيع آفاقنا وتنمية ذواتنا. تُعَدُّ القراءة مصدرًا للمعرفة والترفيه والإلهام. لذا، لنستمتع بسحر القراءة ونستفيد من فوائدها العديدة في حياتنا اليومية. ليكن الكتاب رفيقًا لنا في رحلتنا، وليساعدنا في بناء عالمنا الداخلي وتحقيق طموحاتن"},
          ],
          liked:false,
          disliked:false,
          comments:[
            {img:"/comments/1.png",name:"احمد محمد",comment:"مقال رائع!"},
            {img:"/comments/2.png",name:"نيهال احمد",comment:'"القراءة تنقلنا إلى عوالم بديلة وتزرع فينا بذور الخيال والتفكير النقدي. أنا ممتنة لهذا الموقع الذي يلهمني دائمًا للغوص في صفحات الكتب واكتشاف عوالم جديدة. شكرًا لكم على هذا الإثراء الثقافي الرائع!"'}
          ]
        },
        {
          index:4,
          img:"/articles/5.png",
          title:"كتب تعريفك بتراث وتقاليد الشعوب",
          date:"2 فبراير",
          time:" 5 دقائق قراءة",
          author:"أحمد السيد",
          summary:"القراءة هي نشاط ممتع ومفيد يعزز التعلم والتنمية الشخصية. إن القراءة اليومية لها تأثير كبير على حياتنا وتعزز الذكاء والتفكير الإبداعي. في هذا المقال، سنستكشف فوائد القراءة اليومية وكيف يمكن أن تؤثر بشكل إيجابي على حياتنا.",
          summaryshort:"القراءة هي نشاط ممتع ومفيد يعزز التعلم والتنمية الشخصية.",
          type:"أدب",
          intro:" القراءة هي نافذتنا إلى العالم، إنها رحلة سحرية تأخذنا في استكشاف أفكار الآخرين وتعلم ثقافات جديدة. في العالم العربي، يتمتع الكتاب والأدب بمكانة خاصة، حيث يتميزون بإبداعهم وقدرتهم على صياغة الكلمات بأناقة وجمال. ومن خلال هذا المقال، سنستكشف سحر القراءة في اكتشاف العالم العربي وأهميتها في بناء المعرفة وتعزيز الثقافة.",
          sections:[
            {head:"القراءة نافذة إلى الثقافة ",body:"القراءة تعد أداة قوية لاكتشاف الثقافة العربية والتعرف على تراثها العريق. من خلال قراءة الأدب العربي الكلاسيكي والمعاصر، نلمس جمال اللغة العربية وقوة التعبير فيها. نتعرف على الروائع الأدبية والشعرية التي ترسخ الهوية العربية وتعبر عن تجارب ومشاعر الناس في المنطقة. إنها فرصة للغوص في تاريخنا وتعزيز الفهم للعادات والتقاليد والتحولات الاجتماعية التي شكلتنا."},
            {head:"توسيع الأفق وتحدي العقل",body:" عندما نمارس القراءة، نمارس أيضًا تمرينًا عقليًا يوسع أفقنا ويحفز تفكيرنا. إن قراءة الكتب والمقالات تعزز مهارات التركيز والتفكير النقدي. نتعلم التحليل والتفكير العميق، ونتقن قراءة النصوص بانتباه وتركيز على التفاصيل. كما تعزز القراءة القدرات اللغوية وتثري مفرداتنا وتوسع قدرتنا على التعبير بشكل أفضل."},
            {head:"وسيلة للتأمل والاسترخاء",body:"في عالم مليء بالضغوط والتوترات، تُعد القراءة بوابة للهروب والاسترخاء. عندما نغوص في صفحات الكتب، نجد أنفسنا في عوالم مختلفة تعيد ترتيب أفكارنا وتهدئ أعصابنا. إن الانغماس في قصة مشوقة أو قراءة كتاب يتناول المواضيع التي نهتم بها يمنحنا لحظات هادئة للتأمل والتشبث باللحظة الحالية."},
            {head:"القراءة وتواصل الأجيال",body:"تُعتبر القراءة أيضًا وسيلة لتواصل الأجيال ونقل المعرفة والقيم من جيل إلى جيل. عندما نشارك الكتب والقصص مع أطفالنا وأحفادنا، نبني جسورًا من التواصل والفهم المتبادل. تصبح القراءة لحظات قيّمة تجمع الأسرة وتحفز النقاش والتفاعل البناء بين الأجيال المختلفة."},
            {head:"القراءة وتنمية الذات",body:"إن القراءة تُعَدُّ مصدرًا للتعلم المستمر وتنمية الذات. من خلال قراءة الكتب التعليمية والتطوير الشخصي، نكتسب المهارات والمعرفة الجديدة التي تساعدنا على النمو والتطور. كما تُعَدُّ القراءة للتأمل الذاتي والبحث عن الإلهام والتوجه نحو التحسين المستمر."},
            {head:"القراءة والابتكار والإبداع",body:"عندما نستكشف الكتب والمواد الإبداعية، يتم تحفيز قدراتنا على الابتكار والإبداع. قد تُلهمنا قصة أو فكرة لتجربة أفكار جديدة وتنمية مشاريع مبتكرة. إن القراءة تفتح أمامنا أفقًا للتفكير المستقبلي وتعزز قدرتنا على الابتكار القضايا والمشاكل من زوايا جديدة ومبتكرة."},
            {head:"تعزيز التفاعل الاجتماعي",body:"تُعتبر القراءة أيضًا فرصة لتعزيز التفاعل الاجتماعي والانخراط في مناقشات وحوارات مع الآخرين. عندما نقرأ كتابًا مشتركًا أو ننضم إلى نادي قراءة، يتاح لنا فرصة لتبادل الأفكار والانطباعات وتوسيع آفاقنا. يمكننا أن نتعلم من خلال آراء الآخرين ونتبادل الأفكار والتجارب، مما يغني تجربتنا القرائية ويعزز التواصل الاجتماعي."},
            {head:"القراءة وتحقيق الأهداف",body:"تمتلك القراءة القدرة على توجيهنا نحو تحقيق أهدافنا. عندما نقرأ عن قصص النجاح والإلهام، نجد التحفيز والدفع للتحرك نحو تحقيق أحلامنا. كتب التطوير الذاتي والملهمة تعطينا أدوات واستراتيجيات لتحقيق النجاح والتطور الشخصي."},
            {head:"الختام: ",body:"تبقى القراءة رحلة سحرية ومثيرة في اكتشاف العالم العربي والثقافات الأخرى. إنها أداة قوية لتوسيع آفاقنا وتنمية ذواتنا. تُعَدُّ القراءة مصدرًا للمعرفة والترفيه والإلهام. لذا، لنستمتع بسحر القراءة ونستفيد من فوائدها العديدة في حياتنا اليومية. ليكن الكتاب رفيقًا لنا في رحلتنا، وليساعدنا في بناء عالمنا الداخلي وتحقيق طموحاتن"},
          ],
          liked:false,
          disliked:false,
          comments:[
            {img:"/comments/1.png",name:"احمد محمد",comment:"مقال رائع!"},
            {img:"/comments/2.png",name:"نيهال احمد",comment:'"القراءة تنقلنا إلى عوالم بديلة وتزرع فينا بذور الخيال والتفكير النقدي. أنا ممتنة لهذا الموقع الذي يلهمني دائمًا للغوص في صفحات الكتب واكتشاف عوالم جديدة. شكرًا لكم على هذا الإثراء الثقافي الرائع!"'}
          ]
        },
        {
          index:5,
          img:"/articles/6.png",
          title:"فوائد القراءة اليومية",
          date:"2 فبراير",
          time:" 5 دقائق قراءة",
          author:"أحمد السيد",
          summary:"القراءة هي نشاط ممتع ومفيد يعزز التعلم والتنمية الشخصية. إن القراءة اليومية لها تأثير كبير على حياتنا وتعزز الذكاء والتفكير الإبداعي. في هذا المقال، سنستكشف فوائد القراءة اليومية وكيف يمكن أن تؤثر بشكل إيجابي على حياتنا.",
          summaryshort:"القراءة هي نشاط ممتع ومفيد يعزز التعلم والتنمية الشخصية.",
          type:"أدب",
          intro:" القراءة هي نافذتنا إلى العالم، إنها رحلة سحرية تأخذنا في استكشاف أفكار الآخرين وتعلم ثقافات جديدة. في العالم العربي، يتمتع الكتاب والأدب بمكانة خاصة، حيث يتميزون بإبداعهم وقدرتهم على صياغة الكلمات بأناقة وجمال. ومن خلال هذا المقال، سنستكشف سحر القراءة في اكتشاف العالم العربي وأهميتها في بناء المعرفة وتعزيز الثقافة.",
          sections:[
            {head:"القراءة نافذة إلى الثقافة ",body:"القراءة تعد أداة قوية لاكتشاف الثقافة العربية والتعرف على تراثها العريق. من خلال قراءة الأدب العربي الكلاسيكي والمعاصر، نلمس جمال اللغة العربية وقوة التعبير فيها. نتعرف على الروائع الأدبية والشعرية التي ترسخ الهوية العربية وتعبر عن تجارب ومشاعر الناس في المنطقة. إنها فرصة للغوص في تاريخنا وتعزيز الفهم للعادات والتقاليد والتحولات الاجتماعية التي شكلتنا."},
            {head:"توسيع الأفق وتحدي العقل",body:" عندما نمارس القراءة، نمارس أيضًا تمرينًا عقليًا يوسع أفقنا ويحفز تفكيرنا. إن قراءة الكتب والمقالات تعزز مهارات التركيز والتفكير النقدي. نتعلم التحليل والتفكير العميق، ونتقن قراءة النصوص بانتباه وتركيز على التفاصيل. كما تعزز القراءة القدرات اللغوية وتثري مفرداتنا وتوسع قدرتنا على التعبير بشكل أفضل."},
            {head:"وسيلة للتأمل والاسترخاء",body:"في عالم مليء بالضغوط والتوترات، تُعد القراءة بوابة للهروب والاسترخاء. عندما نغوص في صفحات الكتب، نجد أنفسنا في عوالم مختلفة تعيد ترتيب أفكارنا وتهدئ أعصابنا. إن الانغماس في قصة مشوقة أو قراءة كتاب يتناول المواضيع التي نهتم بها يمنحنا لحظات هادئة للتأمل والتشبث باللحظة الحالية."},
            {head:"القراءة وتواصل الأجيال",body:"تُعتبر القراءة أيضًا وسيلة لتواصل الأجيال ونقل المعرفة والقيم من جيل إلى جيل. عندما نشارك الكتب والقصص مع أطفالنا وأحفادنا، نبني جسورًا من التواصل والفهم المتبادل. تصبح القراءة لحظات قيّمة تجمع الأسرة وتحفز النقاش والتفاعل البناء بين الأجيال المختلفة."},
            {head:"القراءة وتنمية الذات",body:"إن القراءة تُعَدُّ مصدرًا للتعلم المستمر وتنمية الذات. من خلال قراءة الكتب التعليمية والتطوير الشخصي، نكتسب المهارات والمعرفة الجديدة التي تساعدنا على النمو والتطور. كما تُعَدُّ القراءة للتأمل الذاتي والبحث عن الإلهام والتوجه نحو التحسين المستمر."},
            {head:"القراءة والابتكار والإبداع",body:"عندما نستكشف الكتب والمواد الإبداعية، يتم تحفيز قدراتنا على الابتكار والإبداع. قد تُلهمنا قصة أو فكرة لتجربة أفكار جديدة وتنمية مشاريع مبتكرة. إن القراءة تفتح أمامنا أفقًا للتفكير المستقبلي وتعزز قدرتنا على الابتكار القضايا والمشاكل من زوايا جديدة ومبتكرة."},
            {head:"تعزيز التفاعل الاجتماعي",body:"تُعتبر القراءة أيضًا فرصة لتعزيز التفاعل الاجتماعي والانخراط في مناقشات وحوارات مع الآخرين. عندما نقرأ كتابًا مشتركًا أو ننضم إلى نادي قراءة، يتاح لنا فرصة لتبادل الأفكار والانطباعات وتوسيع آفاقنا. يمكننا أن نتعلم من خلال آراء الآخرين ونتبادل الأفكار والتجارب، مما يغني تجربتنا القرائية ويعزز التواصل الاجتماعي."},
            {head:"القراءة وتحقيق الأهداف",body:"تمتلك القراءة القدرة على توجيهنا نحو تحقيق أهدافنا. عندما نقرأ عن قصص النجاح والإلهام، نجد التحفيز والدفع للتحرك نحو تحقيق أحلامنا. كتب التطوير الذاتي والملهمة تعطينا أدوات واستراتيجيات لتحقيق النجاح والتطور الشخصي."},
            {head:"الختام: ",body:"تبقى القراءة رحلة سحرية ومثيرة في اكتشاف العالم العربي والثقافات الأخرى. إنها أداة قوية لتوسيع آفاقنا وتنمية ذواتنا. تُعَدُّ القراءة مصدرًا للمعرفة والترفيه والإلهام. لذا، لنستمتع بسحر القراءة ونستفيد من فوائدها العديدة في حياتنا اليومية. ليكن الكتاب رفيقًا لنا في رحلتنا، وليساعدنا في بناء عالمنا الداخلي وتحقيق طموحاتن"},
          ],
          liked:false,
          disliked:false,
          comments:[
            {img:"/comments/1.png",name:"احمد محمد",comment:"مقال رائع!"},
            {img:"/comments/2.png",name:"نيهال احمد",comment:'"القراءة تنقلنا إلى عوالم بديلة وتزرع فينا بذور الخيال والتفكير النقدي. أنا ممتنة لهذا الموقع الذي يلهمني دائمًا للغوص في صفحات الكتب واكتشاف عوالم جديدة. شكرًا لكم على هذا الإثراء الثقافي الرائع!"'}
          ]
        },
        {
          index:6,
          img:"/articles/7.png",
          title:"رحلة ممتعة لاكتشاف التراث",
          date:"2 فبراير",
          time:" 5 دقائق قراءة",
          author:"أحمد السيد",
          summary:"القراءة هي نشاط ممتع ومفيد يعزز التعلم والتنمية الشخصية. إن القراءة اليومية لها تأثير كبير على حياتنا وتعزز الذكاء والتفكير الإبداعي. في هذا المقال، سنستكشف فوائد القراءة اليومية وكيف يمكن أن تؤثر بشكل إيجابي على حياتنا.",
          summaryshort:"القراءة هي نشاط ممتع ومفيد يعزز التعلم والتنمية الشخصية.",
          type:"فلسفة",
          intro:" القراءة هي نافذتنا إلى العالم، إنها رحلة سحرية تأخذنا في استكشاف أفكار الآخرين وتعلم ثقافات جديدة. في العالم العربي، يتمتع الكتاب والأدب بمكانة خاصة، حيث يتميزون بإبداعهم وقدرتهم على صياغة الكلمات بأناقة وجمال. ومن خلال هذا المقال، سنستكشف سحر القراءة في اكتشاف العالم العربي وأهميتها في بناء المعرفة وتعزيز الثقافة.",
          sections:[
            {head:"القراءة نافذة إلى الثقافة ",body:"القراءة تعد أداة قوية لاكتشاف الثقافة العربية والتعرف على تراثها العريق. من خلال قراءة الأدب العربي الكلاسيكي والمعاصر، نلمس جمال اللغة العربية وقوة التعبير فيها. نتعرف على الروائع الأدبية والشعرية التي ترسخ الهوية العربية وتعبر عن تجارب ومشاعر الناس في المنطقة. إنها فرصة للغوص في تاريخنا وتعزيز الفهم للعادات والتقاليد والتحولات الاجتماعية التي شكلتنا."},
            {head:"توسيع الأفق وتحدي العقل",body:" عندما نمارس القراءة، نمارس أيضًا تمرينًا عقليًا يوسع أفقنا ويحفز تفكيرنا. إن قراءة الكتب والمقالات تعزز مهارات التركيز والتفكير النقدي. نتعلم التحليل والتفكير العميق، ونتقن قراءة النصوص بانتباه وتركيز على التفاصيل. كما تعزز القراءة القدرات اللغوية وتثري مفرداتنا وتوسع قدرتنا على التعبير بشكل أفضل."},
            {head:"وسيلة للتأمل والاسترخاء",body:"في عالم مليء بالضغوط والتوترات، تُعد القراءة بوابة للهروب والاسترخاء. عندما نغوص في صفحات الكتب، نجد أنفسنا في عوالم مختلفة تعيد ترتيب أفكارنا وتهدئ أعصابنا. إن الانغماس في قصة مشوقة أو قراءة كتاب يتناول المواضيع التي نهتم بها يمنحنا لحظات هادئة للتأمل والتشبث باللحظة الحالية."},
            {head:"القراءة وتواصل الأجيال",body:"تُعتبر القراءة أيضًا وسيلة لتواصل الأجيال ونقل المعرفة والقيم من جيل إلى جيل. عندما نشارك الكتب والقصص مع أطفالنا وأحفادنا، نبني جسورًا من التواصل والفهم المتبادل. تصبح القراءة لحظات قيّمة تجمع الأسرة وتحفز النقاش والتفاعل البناء بين الأجيال المختلفة."},
            {head:"القراءة وتنمية الذات",body:"إن القراءة تُعَدُّ مصدرًا للتعلم المستمر وتنمية الذات. من خلال قراءة الكتب التعليمية والتطوير الشخصي، نكتسب المهارات والمعرفة الجديدة التي تساعدنا على النمو والتطور. كما تُعَدُّ القراءة للتأمل الذاتي والبحث عن الإلهام والتوجه نحو التحسين المستمر."},
            {head:"القراءة والابتكار والإبداع",body:"عندما نستكشف الكتب والمواد الإبداعية، يتم تحفيز قدراتنا على الابتكار والإبداع. قد تُلهمنا قصة أو فكرة لتجربة أفكار جديدة وتنمية مشاريع مبتكرة. إن القراءة تفتح أمامنا أفقًا للتفكير المستقبلي وتعزز قدرتنا على الابتكار القضايا والمشاكل من زوايا جديدة ومبتكرة."},
            {head:"تعزيز التفاعل الاجتماعي",body:"تُعتبر القراءة أيضًا فرصة لتعزيز التفاعل الاجتماعي والانخراط في مناقشات وحوارات مع الآخرين. عندما نقرأ كتابًا مشتركًا أو ننضم إلى نادي قراءة، يتاح لنا فرصة لتبادل الأفكار والانطباعات وتوسيع آفاقنا. يمكننا أن نتعلم من خلال آراء الآخرين ونتبادل الأفكار والتجارب، مما يغني تجربتنا القرائية ويعزز التواصل الاجتماعي."},
            {head:"القراءة وتحقيق الأهداف",body:"تمتلك القراءة القدرة على توجيهنا نحو تحقيق أهدافنا. عندما نقرأ عن قصص النجاح والإلهام، نجد التحفيز والدفع للتحرك نحو تحقيق أحلامنا. كتب التطوير الذاتي والملهمة تعطينا أدوات واستراتيجيات لتحقيق النجاح والتطور الشخصي."},
            {head:"الختام: ",body:"تبقى القراءة رحلة سحرية ومثيرة في اكتشاف العالم العربي والثقافات الأخرى. إنها أداة قوية لتوسيع آفاقنا وتنمية ذواتنا. تُعَدُّ القراءة مصدرًا للمعرفة والترفيه والإلهام. لذا، لنستمتع بسحر القراءة ونستفيد من فوائدها العديدة في حياتنا اليومية. ليكن الكتاب رفيقًا لنا في رحلتنا، وليساعدنا في بناء عالمنا الداخلي وتحقيق طموحاتن"},
          ],
          liked:false,
          disliked:false,
          comments:[
            {img:"/comments/1.png",name:"احمد محمد",comment:"مقال رائع!"},
            {img:"/comments/2.png",name:"نيهال احمد",comment:'"القراءة تنقلنا إلى عوالم بديلة وتزرع فينا بذور الخيال والتفكير النقدي. أنا ممتنة لهذا الموقع الذي يلهمني دائمًا للغوص في صفحات الكتب واكتشاف عوالم جديدة. شكرًا لكم على هذا الإثراء الثقافي الرائع!"'}
          ]
        },
        {
          index:7,
          img:"/articles/8.png",
          title:"تعزيز التفكير النقدي من خلال القراءة",
          date:"2 فبراير",
          time:" 5 دقائق قراءة",
          author:"أحمد السيد",
          summary:"القراءة هي نشاط ممتع ومفيد يعزز التعلم والتنمية الشخصية. إن القراءة اليومية لها تأثير كبير على حياتنا وتعزز الذكاء والتفكير الإبداعي. في هذا المقال، سنستكشف فوائد القراءة اليومية وكيف يمكن أن تؤثر بشكل إيجابي على حياتنا.",
          summaryshort:"القراءة هي نشاط ممتع ومفيد يعزز التعلم والتنمية الشخصية.",
          type:"فن",
          intro:" القراءة هي نافذتنا إلى العالم، إنها رحلة سحرية تأخذنا في استكشاف أفكار الآخرين وتعلم ثقافات جديدة. في العالم العربي، يتمتع الكتاب والأدب بمكانة خاصة، حيث يتميزون بإبداعهم وقدرتهم على صياغة الكلمات بأناقة وجمال. ومن خلال هذا المقال، سنستكشف سحر القراءة في اكتشاف العالم العربي وأهميتها في بناء المعرفة وتعزيز الثقافة.",
          sections:[
            {head:"القراءة نافذة إلى الثقافة ",body:"القراءة تعد أداة قوية لاكتشاف الثقافة العربية والتعرف على تراثها العريق. من خلال قراءة الأدب العربي الكلاسيكي والمعاصر، نلمس جمال اللغة العربية وقوة التعبير فيها. نتعرف على الروائع الأدبية والشعرية التي ترسخ الهوية العربية وتعبر عن تجارب ومشاعر الناس في المنطقة. إنها فرصة للغوص في تاريخنا وتعزيز الفهم للعادات والتقاليد والتحولات الاجتماعية التي شكلتنا."},
            {head:"توسيع الأفق وتحدي العقل",body:" عندما نمارس القراءة، نمارس أيضًا تمرينًا عقليًا يوسع أفقنا ويحفز تفكيرنا. إن قراءة الكتب والمقالات تعزز مهارات التركيز والتفكير النقدي. نتعلم التحليل والتفكير العميق، ونتقن قراءة النصوص بانتباه وتركيز على التفاصيل. كما تعزز القراءة القدرات اللغوية وتثري مفرداتنا وتوسع قدرتنا على التعبير بشكل أفضل."},
            {head:"وسيلة للتأمل والاسترخاء",body:"في عالم مليء بالضغوط والتوترات، تُعد القراءة بوابة للهروب والاسترخاء. عندما نغوص في صفحات الكتب، نجد أنفسنا في عوالم مختلفة تعيد ترتيب أفكارنا وتهدئ أعصابنا. إن الانغماس في قصة مشوقة أو قراءة كتاب يتناول المواضيع التي نهتم بها يمنحنا لحظات هادئة للتأمل والتشبث باللحظة الحالية."},
            {head:"القراءة وتواصل الأجيال",body:"تُعتبر القراءة أيضًا وسيلة لتواصل الأجيال ونقل المعرفة والقيم من جيل إلى جيل. عندما نشارك الكتب والقصص مع أطفالنا وأحفادنا، نبني جسورًا من التواصل والفهم المتبادل. تصبح القراءة لحظات قيّمة تجمع الأسرة وتحفز النقاش والتفاعل البناء بين الأجيال المختلفة."},
            {head:"القراءة وتنمية الذات",body:"إن القراءة تُعَدُّ مصدرًا للتعلم المستمر وتنمية الذات. من خلال قراءة الكتب التعليمية والتطوير الشخصي، نكتسب المهارات والمعرفة الجديدة التي تساعدنا على النمو والتطور. كما تُعَدُّ القراءة للتأمل الذاتي والبحث عن الإلهام والتوجه نحو التحسين المستمر."},
            {head:"القراءة والابتكار والإبداع",body:"عندما نستكشف الكتب والمواد الإبداعية، يتم تحفيز قدراتنا على الابتكار والإبداع. قد تُلهمنا قصة أو فكرة لتجربة أفكار جديدة وتنمية مشاريع مبتكرة. إن القراءة تفتح أمامنا أفقًا للتفكير المستقبلي وتعزز قدرتنا على الابتكار القضايا والمشاكل من زوايا جديدة ومبتكرة."},
            {head:"تعزيز التفاعل الاجتماعي",body:"تُعتبر القراءة أيضًا فرصة لتعزيز التفاعل الاجتماعي والانخراط في مناقشات وحوارات مع الآخرين. عندما نقرأ كتابًا مشتركًا أو ننضم إلى نادي قراءة، يتاح لنا فرصة لتبادل الأفكار والانطباعات وتوسيع آفاقنا. يمكننا أن نتعلم من خلال آراء الآخرين ونتبادل الأفكار والتجارب، مما يغني تجربتنا القرائية ويعزز التواصل الاجتماعي."},
            {head:"القراءة وتحقيق الأهداف",body:"تمتلك القراءة القدرة على توجيهنا نحو تحقيق أهدافنا. عندما نقرأ عن قصص النجاح والإلهام، نجد التحفيز والدفع للتحرك نحو تحقيق أحلامنا. كتب التطوير الذاتي والملهمة تعطينا أدوات واستراتيجيات لتحقيق النجاح والتطور الشخصي."},
            {head:"الختام: ",body:"تبقى القراءة رحلة سحرية ومثيرة في اكتشاف العالم العربي والثقافات الأخرى. إنها أداة قوية لتوسيع آفاقنا وتنمية ذواتنا. تُعَدُّ القراءة مصدرًا للمعرفة والترفيه والإلهام. لذا، لنستمتع بسحر القراءة ونستفيد من فوائدها العديدة في حياتنا اليومية. ليكن الكتاب رفيقًا لنا في رحلتنا، وليساعدنا في بناء عالمنا الداخلي وتحقيق طموحاتن"},
          ],
          liked:false,
          disliked:false,
          comments:[
            {img:"/comments/1.png",name:"احمد محمد",comment:"مقال رائع!"},
            {img:"/comments/2.png",name:"نيهال احمد",comment:'"القراءة تنقلنا إلى عوالم بديلة وتزرع فينا بذور الخيال والتفكير النقدي. أنا ممتنة لهذا الموقع الذي يلهمني دائمًا للغوص في صفحات الكتب واكتشاف عوالم جديدة. شكرًا لكم على هذا الإثراء الثقافي الرائع"'},
          ]
        },
      ]
    }
  },
  provide(){
    return{
      articles: this.articles,
    }
  },
  
    
  }
</script>




<style>
#app {
  font-family: 'Cairo', sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  
  color: #2c3e50;
}
</style>
